# -*- coding: utf-8 -*-
"""
用户相关模块：        10000
任务管理模块：        20000
文件处理模块：        30000
在线笔记模块:         40000
服务器资源模块:       50000
公共模块:            60000
"""




code = {
    # =================================  公共模块  =======================
    200: {'code': 200, 'info': '任务执行成功', 'success': True},
    60001: {'code': 60001, 'info': '请求方式错误。'},
    60002: {'code': 60002, 'info': '请求参数错误。'},
    60003: {'code': 60003, 'info': '自定义错误信息。'},
    60004: {'code': 60004, 'info': '请完善信息后提交。'},
    60005: {'code': 60005, 'info': '插入数据库失败。'},

    # =================================  用户模块  =======================
    10001: {'code': 10001, 'info': '请完善用户信息后提交。'},
    10002: {'code': 10002, 'info': '用户名已经存在。'},
    10003: {'code': 10003, 'info': '用户名或密码错误。'},
    10004: {'code': 10004, 'info': '用户不存在，请先注册。'},
    10401: {'code': 10401, 'info': '用户创建失败。'},
    10402: {'code': 10402, 'info': '用户删除失败。'},
    10403: {'code': 10403, 'info': '用户信息更新失败。'},
    10404: {'code': 10404, 'info': '用户头像插入失败。'},
    10405: {'code': 10405, 'info': 'api_key更新失败。'},
    10406: {'code': 10406, 'info': 'api_key删除失败。'},
    10407: {'code': 10407, 'info': '用户认证失败。请重新登录'},
    10408: {'code': 10408, 'info': 'engine 查询失败'},
    10409: {'code': 10409, 'info': '请求参数无效'},
    10410: {'code': 10410, 'info': '非管理员，无权限创建用户'},
    10411: {'code': 10411, 'info': '用户登陆状态异常'},


    # =================================  任务模块  =======================
    20001: {'code': 20001, 'info': '任务名称已经存在，请重新创建任务。'},
    20002: {'code': 20002, 'info': '任务创建失败。'},
    20003: {'code': 20003, 'info': '任务不存在，请先创建任务。'},
    20004: {'code': 20004, 'info': '笔记数据库查询失败。'},
    20005: {'code': 20005, 'info': '笔记写入缓存失败。'},
    20006: {'code': 20006, 'info': '任务删除失败。'},
    20007: {'code': 20007, 'info': '任务获取失败。'},
    20008: {'code': 20008, 'info': '查询文件目录失败。'},
    20009: {'code': 20009, 'info': '无权限删除任务。'},

    # =================================  文件模块  =======================
    30001: {'code': 30001, 'info': '目录名称已经存在，请换个名称。'},
    30002: {'code': 30002, 'info': '文件目录删除失败。'},
    30003: {'code': 30003, 'info': '文件创建失败。'},
    30004: {'code': 30004, 'info': '上传文件不能为空。'},
    30005: {'code': 30005, 'info': '文件不存在。'},
    30006: {'code': 30006, 'info': '下载文件失败。'},
    30007: {'code': 30007, 'info': '文件已经存在。'},

    # =================================  笔记模块模块  =====================
    40001: {'code': 40001, 'info': '笔记名称已经存在，请换个名称。'},
    40002: {'code': 40002, 'info': '笔记创建失败。'},
    40003: {'code': 40003, 'info': '笔记删除失败。'},
    40004: {'code': 40004, 'info': '笔记修改失败。'},
    40005: {'code': 40005, 'info': '未查询到笔记。'},
    40006: {'code': 40006, 'info': '笔记查询失败。'},
    40007: {'code': 40007, 'info': '笔记不存在，删除失败。'},
    40008: {'code': 40008, 'info': '备份数据查询失败。'},
    40009: {'code': 40009, 'info': '备份数据查询失败。'},
    40010: {'code': 40010, 'info': '笔记正在被其他人使用，不能编辑'},
    40011: {'code': 40011, 'info': '取消编辑成功'},
    40012: {'code': 40012, 'info': '不是任务中的成员，没有权限编辑笔记 请申请权限'},
    40013: {'code': 40013, 'info': '搜索关键字为空，请输入关键字进行搜索'},
    40014: {'code': 40014, 'info': '创建的标签已经存在'},
    40015: {'code': 40015, 'info': '标签创建失败'},
    40016: {'code': 40016, 'info': '标签修改失败'},
    40017: {'code': 40017, 'info': '查询文件或笔记日志失败'},
    40018: {'code': 40018, 'info': '没有权限下载笔记'},
    40019: {'code': 40019, 'info': '图片上传失败'},
    40020: {'code': 40020, 'info': '此笔记不支持pdf下载，请使用markdown方式下载'},
}


